# Импорт файла с персонажами
from Characters import *

# Необходимые файлы
artifact_pool_file = 'artifact_pool.txt'     # Копилка артефактов
user_artifacts_file = 'user_artifacts.txt'   # Артефакты игрока

'''Создание копилки артефактов'''
def create_artifact_pool():
    artifacts = [
        '️🛡️ Щит',
        '⚔️ Кинжалы',
        '🧥 Броня',
        '🗺️ Волшебная карта',
        '🏹 Деревянный лук',
        '🧭 Компас',
        '👻 Плащ-невидимка',
        '🦄 Единорог',
    ]

    # Открывает файл artifact_pool.txt в режиме записи 'w'
    with open(artifact_pool_file, 'w', encoding='utf-8') as f:
        # Проходит по всем артефактам в списке
        for artifact in artifacts:
            # Записывает в файл
            f.write(artifact + '\n')

    print('✅ Создана копилка артефактов!')
    return artifacts

'''Загрузка копилки артефактов'''
def load_artifact_pool():
    artifacts = []
    # Открывает файл artifact_pool.txt в режиме чтения  'r'
    with open(artifact_pool_file, 'r', encoding='utf-8') as f:
        # Проходит по каждой строке
        for line in f:
            # Удаляет пробелы
            artifact = line.strip()
            # Если строка существует
            if artifact:
                # Добавляет артефакт в список
                artifacts.append(artifact)
    return artifacts

'''Сохранение копилки артефактов'''
def save_artifact_pool(artifacts):
    # Открывает файл artifact_pool.txt в режиме записи 'w'
    with open(artifact_pool_file, 'w', encoding='utf-8') as f:
        # Проходит по каждому артефакту
        for artifact in artifacts:
            # Записывает в файл
            f.write(artifact + '\n')

'''Выбор артефактов'''
def choose_artifacts():
    # Загружает копилку артефактов
    artifacts = load_artifact_pool()

    # Копия оригинального списка
    original_artifacts = artifacts.copy()
    # Список для отслеживания выбранных артефактов
    # True - выбран, False - доступен
    selected_flags = [False] * len(artifacts)

    # Список для хранения артефактов, выбранных игроком
    player_artifacts = []

    # Игрок выбирает 3 артефакта
    for choice_num in range(1, 4):
        # Бесконечный цикл для повторного запроса, если выбор некорректен
        while True:
            try:
                # Показываем доступные артефакты
                print('\nДоступные артефакты:')
                # Создает пары номер, артефакт
                for i, artifact in enumerate(original_artifacts, 1):
                    # Проверяет, выбран ли артефакт
                    status = '[Выбрано]' if selected_flags[i - 1] else ''
                    # Выводит номер, артефакт и статус
                    print(f'{i}. {artifact} {status}')

                # Запрашивает у игрока номер артефакта
                choice = int(input(f'\nВыберите артефакт: '))

                # Если артефакт входит в диапазон
                if 1 <= choice <= len(original_artifacts):
                    # Проверяет, не выбран ли уже этот артефакт
                    if selected_flags[choice - 1]:
                        print('❌ Этот артефакт уже выбран! Выберите другой.')
                        continue

                    # Выбранный артефакт
                    selected = original_artifacts[choice - 1]
                    # Добавляет артефакт в список артефактов игрока
                    player_artifacts.append(selected)
                    # Помечает текущий артефакт, как выбранный
                    selected_flags[choice - 1] = True

                    # Эффекты некоторых артефактов
                    if choice == 1:   # Щит
                        Hero.shield = True
                        print('Теперь у тебя есть 🛡️ Щит! Он позволяет получать меньше урона.')
                    elif choice == 2:  # Кинжалы
                        Hero.knife = True
                        print('Теперь у тебя есть ⚔️ Кинжалы! Они позволяют наносить больше урона.')
                    elif choice == 3:  # Броня
                        Hero.armor = True
                        print('Теперь у тебя есть 🧥 Броня! Она позволяет получать меньше урона.')
                    elif choice == 5:  # Деревянный лук
                        Hero.luk = True
                        print('Теперь у тебя есть 🏹 Деревянный лук! Он позволяет наносить больше урона.')
                    elif choice == 7:  # Плащ-невидимка
                        Hero.nevidimka = True
                        print('Теперь у тебя есть 👻 Плащ-невидимка! Он позволяет получать меньше урона.')

                    break
                # Если номер не в диапазоне
                else:
                    print(f'❌ Неверный номер! Введите число от 1 до 8')
            except:
                print('Введите число!')

    # Список обновленной копилки (без выбранных артефактов)
    remain_artifacts = []

    # Проходим по всем флагам
    for i, selected in enumerate(selected_flags):
        # Если артефакт не выбран
        if not selected:
            # Добавляет его в список оставшихся артефактов
            remain_artifacts.append(original_artifacts[i])

    # Сохраняет обновленную копилку
    save_artifact_pool(remain_artifacts)

    # Сохраняет артефакты игрока в файле user_artifacts.txt
    with open(user_artifacts_file, 'w', encoding='utf-8') as f:
        for artifact in player_artifacts:
            f.write(artifact + '\n')

    return player_artifacts


'''Сохранение артефактов игрока'''
def save_user_artifacts(artifacts):
    # Открывает файл user_artifacts.txt в режиме записи 'w'
    with open(user_artifacts_file, 'w', encoding='utf-8') as f:
        # Проходит по каждому артефакту
        for artifact in artifacts:
            # Записывает в файл
            f.write(artifact + '\n')

'''Удаление артефактов'''
def remove_artifacts(file, artifact_remove):
    # Открывает файл в режиме чтения 'r'
    with open(file, 'r', encoding='utf-8') as f:
        # Читает все строк
        artifacts = f.readlines()

    # Оставляет только те строки, которые не содержат текст artifact_remove
    new_artifacts = [artifact for artifact in artifacts if artifact_remove not in artifact]

    # Перезаписывает файл
    with open(file, 'w', encoding='utf-8') as f:
        # Записывает все отфильтрованные строки обратно в файл
        f.writelines(new_artifacts)

'''Возврат артефактов в копилку'''
def return_artifacts_to_pool(user_artifacts, artifact_pool):
    # Добавляет все артефакты игрока в общую копилку
    # Метод extend() добавляет все элементы списка user_artifacts в конец списка artifact_pool
    artifact_pool.extend(user_artifacts)

    # Очищает список артефактов игрока
    user_artifacts.clear()

    # Сохраняет обновленную копилку артефактов
    save_artifact_pool(set(artifact_pool)) # set() для удаления повторов
    # Сохраняет пустой список артефактов игрока
    save_user_artifacts(user_artifacts)

    print('✅ Все артефакты возвращены в копилку!')
