# Импорт библиотеки random для генерации случайных чисел
from random import *

# Имя файла для записи хода игры
result_file = 'result.txt'

'''Функция для записи событий лог-файл и вывода на экран'''
def log_event(event):
    # Открывает файл result.txt в режиме добавления 'а'
    with open(result_file, 'a', encoding='utf-8') as f:
        # Запись события в файл с переносом строки
        f.write(event + '\n')
    # Запись события на экране
    print(event)


'''Дескриптор, контролирующий значения в заданном диапазоне'''
class BoundedStat:
    # Устанавливается начальное состояние
    def __init__ (self, name, min_value=0, max_value=100):
        # Имя атрибута
        self.name = name
        # Минимальное значение
        self.min_value = min_value
        # Максимальное значение
        self.max_value = max_value

    # Метод __set__ используется для присвоения значения атрибуту объекта
    def __set__ (self, instance, value):
        # Если значение меньше установленного минимума - устанавливается минимум
        if value < self.min_value:
            value = self.min_value
        # Если значение больше установленного максимума - устанавливается максимум
        elif value > self.max_value:
            value = self.max_value
        # Сохраняется значение в словаре атрибутов экземпляра
        instance.__dict__[self.name] = value

'''Родительский класс для всех персонажей игры'''
class Human:
    # Используется дескриптор для ограничения здоровья и маны
    hp = BoundedStat('hp', 0, 100)
    mp = BoundedStat('mp', 0, 100)

    # Устанавливается начальное состояние
    def __init__(self, name, strength, iq, damage, hp=100, mp=100):
        self.name = name              # Имя персонажа
        self.strength = strength      # Сила
        self.iq = iq                  # Интеллект
        self.damage = damage          # Урон
        self.hp = hp                  # Здоровье
        self.mp = mp                  # Мана
        self.artifacts = []           # Список артефактов

    # Метод получения урона персонажем
    def take_damage(self, damage):
        self.hp -= damage

    # Метод восстановления здоровья
    def regenerate(self, regen):
        self.hp += regen

    # Декоратор, позволяющий узнать жив ли персонаж
    @property
    def is_alive(self):
        # Если здоровье больше 0, персонаж жив
        if self.hp > 0:
            return True
        # Иначе персонаж умер
        else:
            return False

'''Класс главного героя - Артура. Наследуется от класса Human'''
class Hero(Human):
    # Устанавливается начальное состояние
    def __init__(self, name, damage, strength, iq, hp = 100):
        # Функция super() вызывает методы родительского класса Human
        super().__init__(name, strength, iq, damage, hp = 100)
        # Флаги наличия артефактов. В начале игры нет артефактов (False)
        self.excalibur = False    # Меч Экскалибур
        self.graal = False        # Священный Грааль
        self.shield = False       # Щит
        self.knife = False        # Кинжалы
        self.armor = False        # Броня
        self.luk = False          # Деревянный лук
        self.nevidimka = False    # Плащ-невидимка
        self.health_elixir = 0    # Кол-во Эликсира здоровья

    # Простая атака
    def attack(self,  target):
        damage = self.damage
        # Урон увеличивается, если есть кинжалы
        if self.knife:
            damage += 10
        # Урон увеличивается, если есть кинжалы
        if self.luk:
            damage += 5
        # Противник получает урон
        target.take_damage(damage)
        # Логирование события
        log_event(f'Артур атакует Мордреда, Урон: {damage}')

    # Атака Экскалибуром
    def attack_excalibur(self, target):
        # Если есть меч, урон увеличивается
        damage = self.damage + 25
        # Противник получает урон
        target.take_damage(damage)
        # Логирование события
        log_event(f'{self.name} атакует Мордреда 🗡️Экскалибуром, Урон: {damage}')

    # Использование Эликсира здоровья
    def use_health_elixir(self):
        # Если кол-во эликсира больше 0
        if self.health_elixir > 0:
            # Здоровье увеличивается
            self.regenerate(20)
            # Кол-во эликсира уменьшается
            self.health_elixir -= 1
            # Логирование события
            log_event(f'Артур выпил Эликсир здоровья. ❤️ Здоровье: {self.hp}')
            # Возвращает True - эликсир успешно использован
            return True
        # Возвращает False - эликсира не было, действие не выполнено
        return False

    # Получение урона с учетом артефактов
    def take_damage(self, damage):
        if self.shield:
            self.hp = self.hp - damage/1.5  # Щит уменьшает урон в 1.5 раза
        elif self.armor:
            self.hp = self.hp - damage/2    # Броня уменьшает урон в 2 раза
        elif self.nevidimka:
            self.hp = self.hp - damage/2.5  # Плащ-невидимка уменьшает урон в 2.5 раза
        else:
            # Без артефактов получаем обычный урон
            self.hp -= damage

'''Класс мага Мерлина. Наследуется от класса Human'''
class Mag(Human):
    # Устанавливается начальное состояние
    def __init__(self, name, damage, strength, iq, hp = 100, mp= 100, fire_power = 20, healing = 15):
        # Функция super() вызывает методы родительского класса Human
        super().__init__(name, strength, iq, damage, hp = 100, mp= 100)
        self.fire_power = fire_power  # Сила атаки огнем
        self.healing = healing        # Сила лечения

    # Атака огнем
    def attack_fire(self, target):
        # Если маны хватает
        if self.mp >= 43:
            # К урону прибавляется сила огня
            temp = self.damage + self.fire_power
            # Урон - случайное значение в диапазоне от 5 до урона с силой огня
            temp_random = randint(5, temp)
            # Мана уменьшается
            self.mp -= 43
            # Противник получает урон
            target.take_damage(temp_random)
            # Логирование события
            log_event(f'Мерлин атакует Мордреда 🔥огнем, Урон: {temp_random}')
        # Если маны не хватает
        elif self.mp < 43:
            # Логирование события
            log_event(f'Мерлину не хватает маны')
            # Урон + сила + интеллект
            temp = self.damage + int(self.strength * 0.2) + int(self.iq * 0.3)
            # Урон - случайное значение в диапазоне от 5 до урона с преимуществом персонажа
            temp_random = randint(5, temp)
            # Противник получает урон
            target.take_damage(temp_random)
            # Логирование события
            log_event(f'Мерлин атакует Мордреда, Урон: {temp_random}')

    # Получение урона с учетом характеристики персонажа
    def take_damage(self, damage):
        if damage <= 45:
            # Теряется часть здоровья
            self.hp = self.hp - damage + int(damage * 0.8)
            # Восстанавливается мана
            self.mp += self.mp - damage + int(damage * 0.6)
        else:
            self.hp -= damage

    # Лечение союзников
    def heal(self, target):
        # Если маны достаточно
        if self.mp >= 10:
            # Логирование события
            log_event(f'Мерлин лечит {target.name}')
            # Сила лечения + интеллект
            temp = self.healing + int(self.iq*0.4)
            # Мана уменьшается
            self.mp -= 10
            # Лечит союзника
            target.regenerate(temp)
        elif self.mp < 10:
            # Логирование события
            log_event(f'Мерлину не хватает маны для лечения')

'''Класс рыцаря Ланселота. Наследуется от класса Human'''
class Knight(Human):
    # Устанавливается начальное состояние
    def __init__(self, name, damage, strength, iq, hp = 100, mp= 100, shield = 100, spear_power = 25):
        # Функция super() вызывает методы родительского класса Human
        super().__init__(name, strength, iq, damage, hp = 100, mp= 100)
        self.shield = shield              # Прочность щита
        self.spear_power = spear_power    # Сила копья

    # Атака копьем
    def attack_spear(self, target):
        # Если хватает маны
        if self.mp >= 50:
            # Урон + сила копья + часть силы
            temp = self.damage + self.spear_power + int(self.strength*0.5)
            # Урон - случайное значение в диапазоне от 5 до урона с преимуществом персонажа
            temp_random = randint(5, temp)
            # Мана уменьшается
            self.mp -= 50
            # Противник получает урон
            target.take_damage(temp_random)
            # Логирование события
            log_event(f'Ланселот атакует Мордреда ⚔️копьем, Урон: {temp_random}')
        # Если маны не хватает
        elif self.mp < 50:
            # Логирование события
            log_event(f'Ланселоту не хватает маны')
            # Урон + сила + интеллект
            temp = self.damage + int(self.strength * 0.3) + int(self.iq * 0.2)
            # Урон - случайное значение в диапазоне от 5 до урона с преимуществом персонажа
            temp_random = randint(5, temp)
            # Противник получает урон
            target.take_damage(temp_random)
            # Логирование события
            log_event(f'Ланселот атакует Мордреда, Урон: {temp_random}')

    # Получение урона с учетом характеристики персонажа
    def take_damage(self, damage):
        # Если щит цел и прочность щита больше наносимого урона
        if self.shield > 0 and self.shield > damage:
            # Урон отнимается от прочности щита
            self.shield -= damage
            # Логирование события
            log_event(f'Ланселот использовал 🛡️щит. Щит: {self.shield}')
        # Иначе урон здоровью
        else:
            self.hp -= damage

# Создание персонажей игры
Artur = Hero('Артур', strength = 25, iq = 15, damage = 30, hp = 100)
Merlin = Mag('Мерлин', strength = 15, iq = 20, damage = 10, hp = 100, mp = 100)
Lancelot = Knight('Ланселот', strength = 30, iq = 10, damage = 20 , hp = 100, mp = 100)
