# Импорт файла с артефактами
from Artifacts import *

'''Ветка 1 Встреча со старцем'''
def first_branch(arthur, user_artifacts, artifact_pool, story_progress):
    log_event('\n' + '=' * 50)
    log_event(' ' * 10 + 'Встреча со старцем')
    log_event('=' * 50)
    # Логирование события
    log_event('\nТы идешь направо и встречаешь мудрого старца под древним дубом.')
    log_event('Старец 🧙‍♂️: «Приветствую тебя, Артур! Испытай свою мудрость.»')

    # Загадки старца
    # Загадка - это словарь с вопросом, ответом и наградой
    riddles = [
        {'question': 'Что исчезает, как только произнесешь его название?',
        'answer': 'тишина',
        'reward': '🗡️ Экскалибур'},

        {'question': 'Неживое, но может расти. Не дышит, но нуждается в воздухе. Что это?',
        'answer': 'огонь',
        'reward': '🧪 Эликсир здоровья'},

        {'question': 'Зимой и летом одним цветом. Что это?',
        'answer': 'елка'}
    ]
    # Логирование события
    log_event('Старец 🧙‍♂️️: «Отгадай мои загадки и получишь награду!»')

    '''Загадка 1
    Награда - меч Экскалибур и Эликсир здоровья'''
    # Логирование события
    log_event(f'\n🧩 Загадка 1: {riddles[0]['question']}')
    # Запрашивает ответ у игрока. Переводит в нижний регистр и удаляет пробелы
    answer = input('Твой ответ: ').lower().strip()

    # Если ответ правильный
    if answer == riddles[0]['answer']:
        # Логирование события
        log_event('✅ Правильно!  Старец 🧙‍♂️️: «Ты отгадал мою загадку!»')
        log_event(f'🎁 За свою мудрость ты получаешь: {riddles[0]['reward']} и {riddles[1]['reward']}')

        # Дает Экскалибур
        arthur.excalibur = True
        # Дает игроку Эликсир здоровья
        arthur.health_elixir += 1
        # Добавляет полученные артефакты в копилку артефактов
        artifact_pool.append('🗡️ Экскалибур')
        artifact_pool.append('🧪 Эликсир здоровья')
        # Добавляем в файл артефактов игрока
        with open(user_artifacts_file, 'a', encoding='utf-8') as f:
            f.write('\n🗡️ Экскалибур')
            f.write('\n🧪 Эликсир здоровья')

        # Логирование события
        log_event('⭐ Теперь у тебя есть легендарный меч Экскалибур! Он поможет тебе в битве с Мордредом.')
        log_event('⭐ Еще ты получил Эликсир здоровья. Используй его в нужный момент.')

        # Игрок прошел эту ветку.
        # Добавляет метку 'old man' в список пройденных веток
        story_progress.append('old man')
        # Возвращает True, так как ветка пройдена
        return True


    else:
        # Логирование события
        log_event('❌ Неправильно! Ты теряешь 15 здоровья.')
        # Артур получает урон
        Artur.take_damage(15)
        # Логирование события
        log_event(f'❤️ Твое здоровье: {Artur.hp}/100')

        '''Вторая загадка
        Награда - меч Экскалибур'''
        # Логирование события
        log_event(f'\n🧩 Загадка 2: {riddles[1]['question']}')
        # Запрашивает ответ у игрока. Переводит в нижний регистр и удаляет пробелы
        answer = input('Твой ответ: ').lower().strip()

        # Аналогично с загадкой 1

        if answer == riddles[1]['answer']:
            log_event('✅ Правильно!  Старец 🧙‍♂️️: «Ты отгадал мою загадку!»')
            log_event(f'🎁 Ты получаешь: {riddles[0]['reward']}')

            # Дает Экскалибур
            arthur.excalibur = True
            artifact_pool.append('🗡️ Экскалибур')
            with open(user_artifacts_file, 'a', encoding='utf-8') as f:
                f.write('\n🗡️ Экскалибур')
            log_event('⭐ Тебе все же удалось добыть меч!')

            story_progress.append('old man')
            return True

        else:
            log_event('❌ Неправильно! Ты теряешь еще 15 здоровья.')
            # Артур получает урон
            Artur.take_damage(15)
            log_event(f'❤️ Твое здоровье: {Artur.hp}/100')

            '''Третья загадка
            Награда - Эликсир здоровья'''
            log_event(f'\n🧩 Загадка 3: {riddles[2]['question']}')

            # Аналогично с загадкой 1
            while True:
                answer = input('Твой ответ: ').lower().strip()

                if answer == riddles[2]['answer']:
                    log_event('✅ Правильно! Наконец-то!')
                    log_event(f'🎁 Ты получаешь: {riddles[1]['reward']}')

                    arthur.health_elixir += 1
                    artifact_pool.append('🧪 Эликсир здоровья')
                    with open(user_artifacts_file, 'a', encoding='utf-8') as f:
                        f.write('\n🧪 Эликсир здоровья')

                    # Логирование события
                    log_event('Старец 🧙‍♂️️: «К сожалению, я не могу отдать тебе меч Экскалибур. Но вот тебе Эликсир здоровья.»')
                    log_event('Старец 🧙‍♂️️: «Попытай удачу в следующий раз.»')

                    story_progress.append('old man')
                    return True
                else:
                    log_event('❌ Неправильно! Ты теряешь 10 здоровья.')
                    # Артур получает урон
                    Artur.take_damage(10)
                    # Логирование события
                    log_event(f'❤️ Твое здоровье: {Artur.hp}/100')

                    # Если Артур умер
                    if not arthur.is_alive:
                        log_event('💀 Ты падаешь без сил...')
                        return False

                    return True
