# Импорт файла с сохранением и регистрацией
from Save_and_registration import*
# Импорт файла с первой веткой
from First_branch import *
# Импорт файла со второй веткой
from Second_branch import *
# Импорт файла с третьей веткой
from Battle import*

'''Главное меню'''
def show_menu():
    print('\nВыберите действие:')
    print('1. 🆕 Новая игра')
    print('2. ↩️ Продолжить сохраненную игру')
    print('3. 📝 Регистрация')
    print('4. 🔚 Выход')

'''Статус игрока'''
def show_status(arthur, artifacts):
    # Логирование события
    log_event('\n' + '=' * 40)
    log_event(' ' * 10 + 'Ваше состояние')
    log_event('=' * 40)
    log_event(f'❤️ Здоровье: {arthur.hp}/100')
    log_event(f'💪 Сила: {arthur.strength}')
    log_event(f'🧠 Интеллект: {arthur.iq}')
    log_event(f'🗡️ Экскалибур: {'ЕСТЬ ✅' if arthur.excalibur else 'НЕТ ❌'}')
    log_event(f'🏆 Священный Грааль: {'ЕСТЬ ✅' if arthur.graal == True else 'НЕТ ❌'}')
    log_event(f'🧪 Эликсиров здоровья: {arthur.health_elixir}')

    if artifacts:
        log_event(f'🎒 Артефакты: {', '.join(artifacts)}')
    else:
        log_event('🎒 Артефактов нет')
    print('=' * 40)

'''Волшебный лес с развилкой'''
def magic_forest(arthur, user_artifacts, artifact_pool, story_progress):
    # Логирование события
    log_event('\nТы входишь в Волшебный лес. Вокруг слышно пение птиц.')
    log_event('Ты доходишь до развилки.')
    while True:
        print('\n' + '=' * 50)
        print(' ' * 10 + 'Развилка в Волшебном лесу')
        print('=' * 50)
        print('\nТы на развилке. Куда пойдешь?')
        # Игровое меню
        print('1. ➡️ Направо')
        print('2. ⬅️ Налево')

        # Показывает выбор битвы только если пройдена хоть одна ветка
        if story_progress:
            print('3. 👿 Сразиться с Мордредом')

        print('4. 📊 Показать мой статус')
        print('5. 💾 Сохранить игру')
        print('6. 🚪 Выйти в меню')

        try:
            # Запрашивает выбор игрока
            choice = int(input('\nТвой выбор: '))
        except:
            print('❌ Введи число от 1 до 6!')
            continue

        # Направо (к старцу)
        if choice == 1:
            way = first_branch(arthur, user_artifacts, artifact_pool, story_progress)

        # Налево (в пещеру к гному)
        elif choice == 2:
            way = second_branch(arthur, user_artifacts, artifact_pool, story_progress)


        elif choice == 3 and story_progress: # Битва с Мордредом (должна быть хотя бы 1 пройденная ветка)
            if 'battle' in story_progress:
                print('\n👿 Ты уже победил Мордреда!')
            else:
                way = battle(arthur, user_artifacts)
                # Если победили
                if way:
                    story_progress.append('battle')
                    # После победы можно играть дальше или выйти
                    print('\nХочешь продолжить исследовать лес?')
                    print('1. Да, хочу найти еще артефактов!')
                    print('2. Нет, закончить игру')

                    try:
                        # Запрашивается выбор игрока
                        num = int(input('Твой выбор: '))
                        if num == 2:
                            # Завершаем игру
                            return True
                    except:
                        pass
        # Показать статус
        elif choice == 4:
            show_status(arthur, user_artifacts)

        # Сохранить игру
        elif choice == 5:
            load_game()
            save_game(arthur, story_progress, user_artifacts)

        # Выйти в главное меню
        elif choice == 6:
            return True
        else:
            print('❌ Неправильный выбор!')

        # Если Артур мертв
        if not arthur.is_alive:
            log_event('\n💀 У тебя закончилось здоровье!')
            log_event('Игра окончена...')
            # Завершает игру
            return False

    return True

'''Главная функция игры'''
def main(user_artifacts, artifact_pool):
    print('\n' + '=' * 50)
    print(' ' * 9 + '🤴🏻 Приключения короля Артура ⚔️')
    print('=' * 50)

    # Создает файл для логов (ход игры)
    # Открывает файл result.txt в режиме записи 'w'
    with open(result_file, 'w', encoding='utf-8') as f:
        f.write('=' * 50 + '\n')
        f.write('🤴🏻 Приключения короля Артура ⚔️\n')
        f.write('=' * 50 + '\n')


    while True:
        # Показывает главное меню
        show_menu()

        try:
            # Запрашивает выбор игрока
            choice = int(input('\nВыбери действие (1-4): '))
        except:
            print('❌ Введи число от 1 до 4!')
            continue

        # Новая игра
        if choice == 1:
            # Авторизация
            username = log_in_game()
            if not username:
                continue

            # Создаем Артура
            arthur = Hero('Артур', strength = 25, iq = 15, damage = 30, hp = 100)
            # Создает копилку артефактов
            create_artifact_pool()

            # Загружает копилку артефактов
            artifact_pool = load_artifact_pool()
            # Игрок выбирает 3 артефакта
            user_artifacts = choose_artifacts()

            # Список пройденных веток
            story_progress = []

            print('\n' + '=' * 50)
            print(' ' * 10 + 'Начало игры')
            print('=' * 50)
            # Логирование события
            log_event('\nЛегенда:')
            log_event('📜 Ты - король Артур. Над Камелотом нависла опасность.')
            log_event('Предатель Мордред собирается захватить замок.')
            log_event('И только ты можешь помешать ему.')
            log_event('Для этого тебе нужно найти меч Экскалибур и Святой Грааль.')
            log_event('Они затеряны где-то в Волшебном лесу.')
            log_event('Не теряй же времени и отправляйся в путь. 📜')

            # Запускаем игру (в Волшебном лесу)
            way = magic_forest(arthur, user_artifacts, artifact_pool, story_progress)

            if not way:
                print('\n💀 Игра окончена')
                input('Нажми Enter чтобы вернуться в меню...')

        # Продолжить сохраненную игру
        elif choice == 2:
            # Авторизация
            username = log_in_game()
            if not username:
                continue

            # Загружает сохранение
            arthur_specific, user_artifacts, story_progress, artifact_pool = load_game()

            if arthur_specific is None:
                print('❌ Нет сохраненной игры!')
                continue

            else:

                # Восстанавливаем Артура из сохранения
                arthur = Artur
                arthur.hp = arthur_specific['hp']
                arthur.strength = arthur_specific['strength']
                arthur.iq = arthur_specific['iq']
                arthur.excalibur = arthur_specific['excalibur']
                arthur.health_elixir = arthur_specific['health_elixir']


            print('\n✅ Игра загружена!')
            print(f'Прогресс: {len(story_progress)} веток пройдено')

            # Продолжает игру
            way = magic_forest(arthur, user_artifacts, artifact_pool, story_progress)

            if not way:
                print('\n💀 Игра окончена')
                input('Нажми Enter чтобы вернуться в меню...')

        # Регистрация нового игрока
        elif choice == 3:
            username = registrations_user()
            if username:
                print(f'\n✅ Ты зарегистрирован как {username}')
                print('Теперь войди в игру!')
                input('Нажми Enter чтобы продолжить...')

        # Выход из игры
        elif choice == 4:
            # Возвращаем все артефакты в копилку
            return_artifacts_to_pool(user_artifacts, artifact_pool)
            print('\n👋 До свидания!')
            # Выходим из цикла
            break

        else:
            print('❌ Неправильный выбор!')


if __name__ == '__main__':
    # Вызов главной функции
    main('user_artifacts.txt', 'artifact_pool.txt')